<?php

/*
===========================================================

	프로젝트 이름 : 댓글로 별점평가 게시판 스킨

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2015년 12월 12일 토요일 오후 20시 56분 - 날씨 맑음

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 SAM > 댓글로 별점평가 게시판 스킨 > 
===========================================================


*/


/*
여분필드 사용

## 게시글

wr_1        : 별점평가 참여자 수
wr_2        : 별점평가 총 점수
wr_3        : 별점평가 평균 점수 (5점만점)


## 댓글
wr_1 : 별점평가 점수

*/


  //=======================================================
  // 개별 페이지 접근 불가
  IF (!defined('_GNUBOARD_'))                     exit;


  //=======================================================
  // 별점평가_점수
  $start_icon = (int)$_POST['start_icon'];


  //=======================================================
  // 시작 => 별점평가_점수__1점부터_5점__사이_이면
  IF ( $start_icon > 0 && $start_icon < 6 )
  {

      //===================================================
      // 나의_댓글__별점평가_점수__저장하기
      $sql  = "UPDATE {$write_table} SET ";
      $sql .= "wr_1 = '". $start_icon ."', ";
      $sql .= "wr_subject = '". $wr_subject ."' ";
      $sql .= "WHERE mb_id = '". $member['mb_id'] ."' AND wr_id = '". $comment_id ."'";
      
      
       //===================================================
     

      //===================================================
      // 시작 => 쿼리_실행__실패시
      IF ( !sql_query($sql) )
      {
          alert("나의 별점점수를 저장하지 못했습니다.");
      }


      //===================================================
      // 해당_게시글의__별점점수_정보__가져오기
      $sql  = "SELECT COUNT(*) AS cnt, SUM(wr_1) as ssum FROM {$write_table} ";
      $sql .= "WHERE wr_parent = '". $wr['wr_parent'] ."' AND wr_is_comment = '1' AND wr_1 <> ''";
      $res = sql_fetch($sql);


      //===================================================
      // 별점평가_참가자_수
      $star_score_cnt = (int)$res['cnt'];


      //===================================================
      // 별점평가_점수_합계
      $star_score_sum = (int)$res['ssum'];


      //===================================================
      // 별점평가_점수__평균_내기
      $star_score_ave = $star_score_sum/$star_score_cnt;


      //===================================================
      // 별점평가_점수__평균_포맷__소수점_1자리
      $star_score_ave = number_format($star_score_ave, 1);


      //===================================================
      // 게시글__별점평가_점수__저장하기
      $sql  = "UPDATE {$write_table} SET ";
      $sql .= "wr_1 = '". $star_score_cnt ."', ";           // 별점평가 참여자 수
      $sql .= "wr_2 = '". $star_score_sum ."', ";           // 별점평가 총 점수
      $sql .= "wr_3 = '". $star_score_ave ."' ";            // 별점평가 평균 점수 (5점만점)
      $sql .= "WHERE wr_id = '". $wr['wr_parent'] ."'";


      //===================================================
      // 시작 => 쿼리_실행__실패시
      IF ( !sql_query($sql) )
      {
          alert("게시글에 별점점수를 반영하지 못했습니다.");
      }

  }
  // 끝 => 별점평가_점수__1점부터_5점__사이_이면
  //=======================================================


?>