<?php

/*
===========================================================

	프로젝트 이름 : 댓글로 별점평가 게시판 스킨

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2015년 12월 12일 토요일 오후 20시 56분 - 날씨 맑음

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 SAM > 댓글로 별점평가 게시판 스킨 > 
===========================================================


*/


/*

여분필드 사용
wr_1 : 별점평가 참여자 수
wr_2 : 별점평가 총 점수
wr_3 : 별점평가 평균 점수 (5점만점)

*/


  //=======================================================
  // 개별 페이지 접근 불가
  IF (!defined('_GNUBOARD_'))                     exit;


?>